In [2]:
import pandas
pandas._version

In [3]:
obj = pandas.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pandas.Series([4,7,-5,3], index = ['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
import numpy as np

In [15]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
# 자연상수를 해당 값만큼 제곱

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
sdata = {'ohio':35000, 'texas':71000, 'oregeon':16000, 'utah':5000}

In [20]:
obj3 = pandas.Series(sdata)

In [21]:
obj3

ohio       35000
texas      71000
oregeon    16000
utah        5000
dtype: int64

In [22]:
states = ['califonia','ohio','oregon','texas']

In [23]:
obj4 = pandas.Series(sdata, index = states)

In [24]:
obj4

califonia        NaN
ohio         35000.0
oregon           NaN
texas        71000.0
dtype: float64

In [26]:
pandas.isnull(obj4)

califonia     True
ohio         False
oregon        True
texas        False
dtype: bool

In [27]:
#null을 값으로 가지면 참

In [28]:
pandas.notnull(obj4)

califonia    False
ohio          True
oregon       False
texas         True
dtype: bool

In [30]:
obj3 + obj4

califonia         NaN
ohio          70000.0
oregeon           NaN
oregon            NaN
texas        142000.0
utah              NaN
dtype: float64

In [31]:
obj4.name = 'population'

In [32]:
obj4.index.name = 'state'

In [33]:
obj4

state
califonia        NaN
ohio         35000.0
oregon           NaN
texas        71000.0
Name: population, dtype: float64

In [34]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [72]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,9.3,3.2]}
frame = pandas.DataFrame(data)

In [73]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  9.3
5  Nevada  2003  3.2

In [74]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  9.3

In [75]:
pandas.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  9.3
5  2003  Nevada  3.2

In [76]:
frame2 = pandas.DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five','six'])

In [77]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  9.3  NaN
six    2003  Nevada  3.2  NaN

In [78]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [79]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [80]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [81]:
# three열의 정보를 표기

In [82]:
frame2['debt'] = 16.5

In [83]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  9.3  16.5
six    2003  Nevada  3.2  16.5

In [84]:
frame2['debt'] = np.arange(6.)

In [85]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  9.3   4.0
six    2003  Nevada  3.2   5.0

In [86]:
val = pandas.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])

In [87]:
frame2['debt'] = val

In [88]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  9.3  -1.7
six    2003  Nevada  3.2   NaN

In [89]:
frame2['eastern'] = frame2.state == 'ohio'

In [90]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN    False
two    2001    Ohio  1.7  -1.2    False
three  2002    Ohio  3.6   NaN    False
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  9.3  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [91]:
del frame2['eastern']

In [92]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [93]:
pop = {'nevada':{2001:2.4, 2002:2.9}, 'ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [94]:
frame3 = pandas.DataFrame(pop)

In [95]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [96]:
frame3.T

        2001  2002  2000
nevada   2.4   2.9   NaN
ohio     1.7   3.6   1.5

In [97]:
pandas.DataFrame(pop,index = [2001,2002,2003])

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

SyntaxError: invalid syntax (<ipython-input-100-dfa69961e4bd>, line 1)